controltheory/beamer/6/6_6_feedback.tex
% Created 2016-11-21 Mon 18:41
\documentclass[table]{beamer}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{etex}
\usepackage{amsmath}
\usepackage{pstricks}
\usepackage{pgfplots}
\pgfplotsset{compat=1.8}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
\setbeamercovered{transparent}
\subtitle{反馈校正}
\providecommand{\alert}[1]{\textbf{#1}}

\title{线性系统校正方法}
\author{邢超}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}












\section{校正原理}
\label{sec-1}
\begin{frame}
\frametitle{反馈校正原理}
\label{sec-1-1}


\begin{tikzpicture}[node distance=1em,auto,>=latex', thick]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$R(s)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
\path[->](r) edge node {} (p1) ; 
\path[blue,->] node[draw, right =of p1] (gc) {$G_1(s)$}; 
\path[->] (p1) edge node {} (gc) ; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of gc] (p2) {}; 
\path[->] (gc) edge node {} (p2) ; 
\path[blue,->] node[draw, inner sep=5pt,right =of p2] (g) {$G_2(s)$}; 
\path[->] (p2) edge node {} (g); 
\path[->] node[ right =of g] (o) {$C(s)$}; 
\path[->] (g) edge node {} (o); 
\path[red,->] node[draw, inner sep=5pt,below =of g] (gf) {$G_c(s)$}; 
\path[ draw] (g.east)+(0.3em,0)  |-  (gf); 
\path[->, draw] (gf.west) -| node[very near end] {$-$} (p2); 
\path[->, draw] (g.east)+(0.3em,0) -- +(0.3em,-5em) -| node[very near end] {$-$} (p1); 
\end{tikzpicture} 

\begin{itemize}
\item 系统开环传递函数为:  
    \[G(s)=\frac{G_1(s)G_2(s)}{1+G_2(s)G_c(s)}\]  
    其中 $G_c$  为反馈校正传递函数.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{反馈校正原理(续)}
\label{sec-1-2}


\begin{itemize}
\item 若在系统工作频段内(动态性能起主要影响的频段内)有:  $|G_2(s)G_c(s)|\gg 1$  成立,则
      \begin{eqnarray*}
      G(s) & = &\frac{G_1(s)G_2(s)}{1+G_2(s)G_c(s)} \\
           &\approx& \frac{G_1(s)G_2(s)}{G_2(s)G_c(s)}\\ 
           &=& \frac{G_1(s)}{G_c}
      \end{eqnarray*}
\item <2->表明校正后的系统特性几乎与被反馈校正装置包围的环节无关.
\end{itemize}

\mode<article>{基本原理: 用反馈校正装置包围未校正系统中对动态性能改善有重大妨碍作用的某些环节,在满足  $|G_2G_c|\gg 1$  的条件下,局部反馈回路的特性主要取决于反馈校正装置,而与被包围部分无关.}
\end{frame}
\section{反馈校正的特点}
\label{sec-2}
\begin{frame}
\frametitle{反馈校正的特点}
\label{sec-2-1}

\begin{itemize}
\item <2->削弱非线性的影响
\item <3->减小系统的时间常数
\item <4->降低系统对参数变化的敏感性
\item <5->抑制系统噪声
\end{itemize}
\end{frame}
\section{反馈校正的设计方法}
\label{sec-3}
\begin{frame}
\frametitle{转化为串联校正设计}
\label{sec-3-1}

\begin{eqnarray*}
G(s) &=& \frac{G_1(s)}{G_c(s)} \\
G_f(s) & = &\frac{1}{G_c(s)} \\
G(s) &=& G_1(s)G_f(s)
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{反馈校正示例1}
\label{sec-3-2}

测速-相角超前反馈校正系统如下图所示, $G_f(s)=\frac{T_2s}{T_2s+1}K_t's$ , $K_1=440,T_1=0.025$ 要求校正后 $\gamma''\geq 50^{\circ},\omega_c''\geq 40$ 并具有一定的抑制噪声能力，求解测速反馈系数 $K_t'$, 超前网络时间常数 $T_2$

\begin{tikzpicture}[node distance=1em,auto,>=latex', thick]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$R(s)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
\path[->](r) edge node {} (p1) ; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of p1] (p2) {}; 
\path[->] (p1) edge node {} (p2) ; 
\path[blue,->] node[draw, inner sep=5pt,right =of p2] (g) {$\frac{K_1}{s(T_1s+1)}$}; 
\path[->] (p2) edge node {} (g); 
\path[->] node[ right =of g] (o) {$C(s)$}; 
\path[->] (g) edge node {} (o); 
\path[red,->] node[draw, inner sep=5pt,below =of g] (gf) {$G_f(s)$}; 
\path[ draw] (g.east)+(0.3em,0)  |-  (gf); 
\path[->, draw] (gf.west) -| node[very near end] {$-$} (p2); 
\path[->, draw] (g.east)+(0.3em,0) -- +(0.3em,-5em) -| node[very near end] {$-$} (p1); 
\end{tikzpicture} 
\end{frame}
\begin{frame}
\frametitle{反馈校正示例1求解}
\label{sec-3-3}

\begin{align*}
G(s) &=\frac{K_1}{s(T_1s+1)}\frac{(T_1s+1)(T_2s+1)}{(T's+1)(T''s+1)}\\
T' &=\frac{T_2}{T''}T_1 \\
T'' &= T_1+(1+K_1K_t')T_2-T' \\
\end{align*}
可看作滞后-超前校正，取 $\omega_c''=42$ 得 $T'/T_1=T_2/T''=0.1,T'=0.0025$
$\gamma''=180^{\circ}-90^{\circ}-\arctan T'\omega_c''+\arctan T_2\omega_c''-\arctan T''\omega_c''>50^{\circ}$ 取 $T_2=0.1,T''=1$ 得 $\gamma''=72^{\circ},K_t'\approx 0.02$
\end{frame}
\begin{frame}
\frametitle{综合法设计反馈校正网絡:原理}
\label{sec-3-4}

\begin{itemize}
\item 校正后系统开环传递函数  $G(s)\approx\frac{G_1(s)}{G_c(s)}$
\item <2->按综合法设计系统期望传递函数  $G(s)$  ,则 $G_c(s)\approx\frac{G_0(s)}{G(s)}$
\item <3->使用条件:
     \begin{eqnarray*}
      |G_2 G_c| & > & 1 \\
      G_0 & = & G_1 G_2 \\
      G &=& \frac{G_1}{G_c}\\
        &=& \frac{G_0}{G_2 G_c} \\
      |G| & <& | G_{0} | \\ 
      20\lg|G_0|&>&20\lg|G|
     \end{eqnarray*}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{综合法设计反馈校正网絡:设计步聚}
\label{sec-3-5}

\begin{itemize}
\item 按  $e_{ss}$  要求,确定开环增益 $K$  ,并画出确定了 $K$  的 $20\lg|G_0(s)|$
\item 按综合法设计期望开环对数幅频特性 $20\lg|G(s)|$
\item <2->按  $20\lg|G_2 G_c|=20\lg|G_0(s)|-20\lg |G(s)|$  求解  $G_2(s)G_c(s)$
\item <3->检查局部反馈回路稳定性,以及是否满足:  
           \[|G_2(j\omega_c)G_c(j\omega_c)|\gg 1\]
\item <4->由 $G_2G_c$ 求解 $G_c$
\item <5->检验校正后的系统是否满足设计要求
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{综合法反馈校正示例1}
\label{sec-3-6}

设系统结构图如下，其中 $G_1(s)=\frac{K_1}{0.014s+1}$ , $G_2(s)=\frac{12}{(0.1s+1)(0.02s+1)}$ , $G_3(s)=\frac{0.0025}{s}$ , $0<K_1<6000$ 。设计反馈校正装置 $G_c(s)$ 满足以下指标：
\begin{itemize}
\item 静态速度误差系数 $K_v\geq 150$
\item 单位阶跃输入下的超调量 $\sigma\%\leq 40\%$
\item 单位阶跃输入下的调节时间 $t_s\leq 1s$
\end{itemize}

\begin{tikzpicture}[node distance=1em,auto,>=latex', thick]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$R(s)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
\path[->](r) edge node {} (p1) ; 
\path[blue,->] node[draw, right =of p1] (g1) {$G_1(s)$}; 
\path[->] (p1) edge node {} (g1) ; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of g1] (p2) {}; 
\path[->] (g1) edge node {} (p2) ; 
\path[blue,->] node[draw, inner sep=5pt,right =of p2] (g2) {$G_2(s)$}; 
\path[->] (p2) edge node {} (g2); 
\path[red,->] node[draw, inner sep=5pt,below =of g2] (gf) {$G_c(s)$}; 
\path[ draw] (g2.east)+(0.3em,0)  |-  (gf); 
\path[->, draw] (gf.west) -| node[very near end] {$-$} (p2); 
\path[blue,->] node[draw, inner sep=5pt,right =of g2] (g3) {$G_3(s)$}; 
\path[->] (g2) edge node {} (g3); 
\path[->] node[ right =of g3] (o) {$C(s)$}; 
\path[->] (g3) edge node {} (o); 
\path[->, draw] (g3.east)+(0.3em,0) -- +(0.3em,-5em) -| node[very near end] {$-$} (p1); 
\end{tikzpicture} 
\end{frame}
\begin{frame}
\frametitle{综合法反馈校正示例1求解}
\label{sec-3-7}

\begin{itemize}
\item $K_1=150/0.0025=5000$ , $G_o(s)=\frac{150}{s(0.014s+1)(0.02s+1)(0.1s+1)}$ , $\omega_c'=38.7$
\item 期望特性中频段: $M_r=1.6,\omega_c=13,\omega_3=1/0.014=71.3,\omega_2=4,\gamma=63.3^{\circ}$
\item 低频段: $\omega_1=0.35$
\item 高频段: $\omega_4=75$
\item 期望特性 $G_E(s)=\frac{150(0.25s+1)}{2.86s^2(0.013s+1)}$
\item $G_2G_c\approx 1+G_2G_c=G_o/G_E$ 得
\begin{itemize}
\item $G_2G_c\approx \frac{2.86s(0.013s+1)}{(0.25s+1)(0.1s+1)(0.02s+1)(0.014s+1)}$
\item $G_2G_c\approx \frac{2.86s}{(0.25s+1)(0.1s+1)(0.02s+1)}$
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{综合法反馈校正示例1求解(续)}
\label{sec-3-8}

\begin{itemize}
\item $\gamma(G_2G_c)=44.3^{\circ}$ 内环稳定
\item $20\lg(|G_2(j\omega_c)G_c(j\omega_c)|)=18.9$ 满足 $|G_2G_c|\gg 1$
\item $G_c=\frac{0.238s}{0.25s+1}$
\item 验算: $K_v=150,\gamma=54.3^{\circ},M_r=1.23,\sigma\%=25.2\%,t_s=0.6s$  符合要求
\end{itemize}
  
\end{frame}

\end{document}
